cases/ibm_3Ddunes/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 8.165793991965504e-7;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sideWall1
    {
        type            symmetryPlane;
    }
    sideWall2
    {
        type            symmetryPlane;
    }
    top
    {
        type            symmetryPlane;
    }

    bottom
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    IB_bed
    {
//        type            epsilonWallFunction;
//        value           $internalField;
        type            immersedBoundaryEpsilonWallFunction;
        patchType       immersedBoundary;
        refValue        uniform 1e-10;
        refGradient     uniform 0;
        fixesValue      false;
        setDeadCellValue true;
        deadCellValue   1e-10;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;

        value           $internalField;
    }

   
   
}

// ************************************************************************* //
