cases/ibm_3Ddunes/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.000255;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    { 
        type            cyclic;
    }
    sideWall1
    {
        type            symmetryPlane;
    }
    sideWall2
    {
        type            symmetryPlane;
    }

    top
    {
        type            symmetryPlane;
    }

    bottom
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    IB_bed
    {
//        type            kqRWallFunction;
//        value           $internalField;
        type            immersedBoundaryWallFunction;
        patchType       immersedBoundary;
        refValue        uniform 1e-10;
        refGradient     uniform 0;
        fixesValue      false;
        setDeadCellValue yes;
        deadCellValue   1e-10;

        value           $internalField;
    }
 }     
// ************************************************************************* //
