cases/ibm_3Ddunes/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    { 
        type            cyclic;
    }
    sideWall1
    {
        type            symmetryPlane;
    }
    sideWall2
    {
        type            symmetryPlane;
    }
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        //type            nutkWallFunction;
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    IB_bed
    {
        //type            nutUSpaldingWallFunction;
        value           uniform 0;
        type            immersedBoundaryWallFunction;
        patchType       immersedBoundary;
        refValue        uniform 0;
        refGradient     uniform 0;
        fixesValue      false;
        setDeadCellValue false;
        deadCellValue   0;
        value           uniform 0;
    }

}

// ************************************************************************* //
