cases/ibm_3Ddunes/system/sampleDict_y_-0.225
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
setFormat raw;

surfaceFormat raw;

formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPatchConstrained;

fields
(
    p
    U
);
sets
(
    somePoints_-0.225
    {
        type    cloud;
        axis    xyz;
        points  (
                 (0.0 -0.225 0.00500806240849)
                 (0.0 -0.225 0.00600806240849)
                 (0.0 -0.225 0.00800806240849)
                 (0.0 -0.225 0.0100080624085)
                 (0.0 -0.225 0.0120080624085)
                 (0.0 -0.225 0.0150080624085)
                 (0.0 -0.225 0.0200080624085)
                 (0.0 -0.225 0.0250080624085)
                 (0.0 -0.225 0.0300080624085)
                 (0.0 -0.225 0.0350080624085)
                 (0.0 -0.225 0.0400080624085)
                 (0.0 -0.225 0.0500080624085)
                 (0.0 -0.225 0.0600080624085)
                 (0.0 -0.225 0.0700080624085)
                 (0.0 -0.225 0.0800080624085)
                 (0.0 -0.225 0.100008062408)
                 (0.0 -0.225 0.120008062408)
                 (0.0 -0.225 0.150008062408)
                 (0.0 -0.225 0.200008062408)
                 (0.0 -0.225 0.250008062408)
                 (0.0 -0.225 0.300008062408)
                 (0.0 -0.225 0.350008062408)
                 (0.0 -0.225 0.400008062408)
                 (0.0 -0.225 0.450008062408)
                 (0.0 -0.225 0.500008062408)
                 (0.04 -0.225 0.00513620819861)
                 (0.04 -0.225 0.00613620819861)
                 (0.04 -0.225 0.00813620819861)
                 (0.04 -0.225 0.0101362081986)
                 (0.04 -0.225 0.0121362081986)
                 (0.04 -0.225 0.0151362081986)
                 (0.04 -0.225 0.0201362081986)
                 (0.04 -0.225 0.0251362081986)
                 (0.04 -0.225 0.0301362081986)
                 (0.04 -0.225 0.0351362081986)
                 (0.04 -0.225 0.0401362081986)
                 (0.04 -0.225 0.0501362081986)
                 (0.04 -0.225 0.0601362081986)
                 (0.04 -0.225 0.0701362081986)
                 (0.04 -0.225 0.0801362081986)
                 (0.04 -0.225 0.100136208199)
                 (0.04 -0.225 0.120136208199)
                 (0.04 -0.225 0.150136208199)
                 (0.04 -0.225 0.200136208199)
                 (0.04 -0.225 0.250136208199)
                 (0.04 -0.225 0.300136208199)
                 (0.04 -0.225 0.350136208199)
                 (0.04 -0.225 0.400136208199)
                 (0.04 -0.225 0.450136208199)
                 (0.04 -0.225 0.500136208199)
                 (0.08 -0.225 0.00556440905901)
                 (0.08 -0.225 0.00656440905901)
                 (0.08 -0.225 0.00856440905901)
                 (0.08 -0.225 0.010564409059)
                 (0.08 -0.225 0.012564409059)
                 (0.08 -0.225 0.015564409059)
                 (0.08 -0.225 0.020564409059)
                 (0.08 -0.225 0.025564409059)
                 (0.08 -0.225 0.030564409059)
                 (0.08 -0.225 0.035564409059)
                 (0.08 -0.225 0.040564409059)
                 (0.08 -0.225 0.050564409059)
                 (0.08 -0.225 0.060564409059)
                 (0.08 -0.225 0.070564409059)
                 (0.08 -0.225 0.080564409059)
                 (0.08 -0.225 0.100564409059)
                 (0.08 -0.225 0.120564409059)
                 (0.08 -0.225 0.150564409059)
                 (0.08 -0.225 0.200564409059)
                 (0.08 -0.225 0.250564409059)
                 (0.08 -0.225 0.300564409059)
                 (0.08 -0.225 0.350564409059)
                 (0.08 -0.225 0.400564409059)
                 (0.08 -0.225 0.450564409059)
                 (0.08 -0.225 0.500564409059)
                 (0.12 -0.225 0.00625458240739)
                 (0.12 -0.225 0.00725458240739)
                 (0.12 -0.225 0.00925458240739)
                 (0.12 -0.225 0.0112545824074)
                 (0.12 -0.225 0.0132545824074)
                 (0.12 -0.225 0.0162545824074)
                 (0.12 -0.225 0.0212545824074)
                 (0.12 -0.225 0.0262545824074)
                 (0.12 -0.225 0.0312545824074)
                 (0.12 -0.225 0.0362545824074)
                 (0.12 -0.225 0.0412545824074)
                 (0.12 -0.225 0.0512545824074)
                 (0.12 -0.225 0.0612545824074)
                 (0.12 -0.225 0.0712545824074)
                 (0.12 -0.225 0.0812545824074)
                 (0.12 -0.225 0.101254582407)
                 (0.12 -0.225 0.121254582407)
                 (0.12 -0.225 0.151254582407)
                 (0.12 -0.225 0.201254582407)
                 (0.12 -0.225 0.251254582407)
                 (0.12 -0.225 0.301254582407)
                 (0.12 -0.225 0.351254582407)
                 (0.12 -0.225 0.401254582407)
                 (0.12 -0.225 0.451254582407)
                 (0.12 -0.225 0.501254582407)
...
);
    }
);
// *********************************************************************** //