cases/ibm_3Ddunes/system/sampleDict_y_0.45
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
setFormat raw;

surfaceFormat raw;

formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPatchConstrained;

fields
(
    p
    U
);
sets
(
    somePoints_0.45
    {
        type    cloud;
        axis    xyz;
        points  (
                 (0.0 0.45 0.00500806240849)
                 (0.0 0.45 0.00600806240849)
                 (0.0 0.45 0.00800806240849)
                 (0.0 0.45 0.0100080624085)
                 (0.0 0.45 0.0120080624085)
                 (0.0 0.45 0.0150080624085)
                 (0.0 0.45 0.0200080624085)
                 (0.0 0.45 0.0250080624085)
                 (0.0 0.45 0.0300080624085)
                 (0.0 0.45 0.0350080624085)
                 (0.0 0.45 0.0400080624085)
                 (0.0 0.45 0.0500080624085)
                 (0.0 0.45 0.0600080624085)
                 (0.0 0.45 0.0700080624085)
                 (0.0 0.45 0.0800080624085)
                 (0.0 0.45 0.100008062408)
                 (0.0 0.45 0.120008062408)
                 (0.0 0.45 0.150008062408)
                 (0.0 0.45 0.200008062408)
                 (0.0 0.45 0.250008062408)
                 (0.0 0.45 0.300008062408)
                 (0.0 0.45 0.350008062408)
                 (0.0 0.45 0.400008062408)
                 (0.0 0.45 0.450008062408)
                 (0.0 0.45 0.500008062408)
                 (0.04 0.45 0.00514317465121)
                 (0.04 0.45 0.00614317465121)
                 (0.04 0.45 0.00814317465121)
                 (0.04 0.45 0.0101431746512)
                 (0.04 0.45 0.0121431746512)
                 (0.04 0.45 0.0151431746512)
                 (0.04 0.45 0.0201431746512)
                 (0.04 0.45 0.0251431746512)
                 (0.04 0.45 0.0301431746512)
                 (0.04 0.45 0.0351431746512)
                 (0.04 0.45 0.0401431746512)
                 (0.04 0.45 0.0501431746512)
                 (0.04 0.45 0.0601431746512)
                 (0.04 0.45 0.0701431746512)
                 (0.04 0.45 0.0801431746512)
                 (0.04 0.45 0.100143174651)
                 (0.04 0.45 0.120143174651)
                 (0.04 0.45 0.150143174651)
                 (0.04 0.45 0.200143174651)
                 (0.04 0.45 0.250143174651)
                 (0.04 0.45 0.300143174651)
                 (0.04 0.45 0.350143174651)
                 (0.04 0.45 0.400143174651)
                 (0.04 0.45 0.450143174651)
                 (0.04 0.45 0.500143174651)
                 (0.08 0.45 0.00556440905901)
                 (0.08 0.45 0.00656440905901)
                 (0.08 0.45 0.00856440905901)
                 (0.08 0.45 0.010564409059)
                 (0.08 0.45 0.012564409059)
                 (0.08 0.45 0.015564409059)
                 (0.08 0.45 0.020564409059)
                 (0.08 0.45 0.025564409059)
                 (0.08 0.45 0.030564409059)
                 (0.08 0.45 0.035564409059)
                 (0.08 0.45 0.040564409059)
                 (0.08 0.45 0.050564409059)
                 (0.08 0.45 0.060564409059)
                 (0.08 0.45 0.070564409059)
                 (0.08 0.45 0.080564409059)
                 (0.08 0.45 0.100564409059)
                 (0.08 0.45 0.120564409059)
                 (0.08 0.45 0.150564409059)
                 (0.08 0.45 0.200564409059)
                 (0.08 0.45 0.250564409059)
                 (0.08 0.45 0.300564409059)
                 (0.08 0.45 0.350564409059)
                 (0.08 0.45 0.400564409059)
                 (0.08 0.45 0.450564409059)
                 (0.08 0.45 0.500564409059)
                 (0.12 0.45 0.00644234470174)
                 (0.12 0.45 0.00744234470174)
                 (0.12 0.45 0.00944234470174)
                 (0.12 0.45 0.0114423447017)
                 (0.12 0.45 0.0134423447017)
                 (0.12 0.45 0.0164423447017)
                 (0.12 0.45 0.0214423447017)
                 (0.12 0.45 0.0264423447017)
                 (0.12 0.45 0.0314423447017)
                 (0.12 0.45 0.0364423447017)
                 (0.12 0.45 0.0414423447017)
                 (0.12 0.45 0.0514423447017)
                 (0.12 0.45 0.0614423447017)
                 (0.12 0.45 0.0714423447017)
                 (0.12 0.45 0.0814423447017)
                 (0.12 0.45 0.101442344702)
                 (0.12 0.45 0.121442344702)
                 (0.12 0.45 0.151442344702)
                 (0.12 0.45 0.201442344702)
                 (0.12 0.45 0.251442344702)
                 (0.12 0.45 0.301442344702)
                 (0.12 0.45 0.351442344702)
                 (0.12 0.45 0.401442344702)
                 (0.12 0.45 0.451442344702)
                 (0.12 0.45 0.501442344702)
...
);
    }
);
// *********************************************************************** //