cases/ibm_3Ddunes/system/topoSetDict3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      cellSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
     	name    porosity_box;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box	     (0 -0.95 -0.0155)(0.45 -0.55 0.149); 
        }
    }

    {
        name    up_cell;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box      (-1.55 -0.95 0)(-1.45 0.95 0.149);
        }
    }
    {
        name    down_cell;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box      (1.9 -0.95 0)(2 0.95 0.149);
        }
    }

);


// ************************************************************************* //
